a='зажал как как заведение в центре частыми были хачи алексей до каждый подходя столику которым кавказцы сжимал что давалось некоторым из-за что герой побаловаться большим заказанным по за просроченными алексей почувствовал покалывания сердце что мог питался в дешевыми на не денег раз пытался убить зайцев сев диету похудеть сэкономить на за алексей думал избавившись девственности кардинально свою тот что него давно стояло на жесткое он из кое-как день отправился в ему повезло попалось место и подоткнув сиденье чтобы дай не кому-нибудь закрыл и мечтать том войдет квартиру компьютер на часов в мир'
#print(len(a.split()))

b='aye'
b=b[0].upper()+b[1:]
c='Basota'
c=c[0].lower()+c[1:]
d=b+' '+c
print(d)